export class DataProvider {

  code = [
    {
      "code": " ว.0",
      "detail": "คำสั่ง"
    },
    {
      "code": "  ว.00",
      "detail": "รอก่อน / คอยก่อน /ให้คอยอยู่"
    },
    {
      "code": "  ว.01",
      "detail": "ที่ทำงาน"
    },
    {
      "code": "  ว.02",
      "detail": "ที่พัก / บ้าน"
    },
    {
      "code": "  ว.  1",
      "detail": "อยุ่ที่ไหน / อยู่ที่......"
    },
    {
      "code": "  ว.  2",
      "detail": "ได้ยินหรือไม่/ตอบด้วย/ได้ยินแล้ว"
    },
    {
      "code": "  ว.  3",
      "detail": "ทวนข้อความซ้ำอีกครั้ง"
    },
    {
      "code": "  ว.  4",
      "detail": "ปฏิบัติหน้าที่/ดำเนินการ"
    },
    {
      "code": "  ว.  5",
      "detail": "ราชการลับ/ความลับ"
    },
    {
      "code": "  ว.  6",
      "detail": "ขอติดต่อด้วย/โต้ตอบด้วย"
    },
    {
      "code": "  ว.  7",
      "detail": "ขอความช่วยเหลือ(มีเหตุคับขัน)"
    },
    {
      "code": "  ว.  8",
      "detail": "ข่าวสาร/ข้อความ"
    },
    {
      "code": "  ว.  9",
      "detail": "มีเหตุฉุกเฉิน"
    },
    {
      "code": "  ว.10",
      "detail": "อยู่ประจำที่/ติดต่อทาง ว.ได้"
    },
    {
      "code": "  ว.11",
      "detail": "หยุดพัก/ติดต่อทาง ว.ได้"
    },
    {
      "code": "  ว.12",
      "detail": "หยุดพัก/ติดต่อทาง ว.ไม่ได้"
    },
    {
      "code": "  ว.13",
      "detail": "ติดต่อทางโทรศัพท์"
    },
    {
      "code": "  ว.14",
      "detail": "เลิกงาน/ปิดสถานี"
    },
    {
      "code": "  ว.15",
      "detail": "ให้มาพบ/นัดหมาย"
    },
    {
      "code": "  ว.16",
      "detail": "ทดสอบสัญญาณวิทยุ"
    },
    {
      "code": "  ว.16 - 1",
      "detail": "จับใจความไม่ได้"
    },
    {
      "code": "  ว.16 - 2",
      "detail": "เสียงไม่ชัดเจน"
    },
    {
      "code": "  ว.16 - 3",
      "detail": "เสียงชัดเจนพอใช้ได้"
    },
    {
      "code": "  ว.16 - 4",
      "detail": "เสียงชัเดจนดี"
    },
    {
      "code": "  ว.16 - 5",
      "detail": "เสียงชัดเจนดีมาก"
    },
    {
      "code": "  ว.17",
      "detail": "มีอันตรายห้ามผ่าน"
    },
    {
      "code": "  ว.18",
      "detail": "นำรถยนต์ออกทดลองเครื่อง/รถเสีย"
    },
    {
      "code": "  ว.19",
      "detail": "สถานีถูกยึด/ถูกโจมตี"
    },
    {
      "code": "  ว.20",
      "detail": "จับกุม/ตรวจค้น"
    },
    {
      "code": "  ว.21",
      "detail": "ออกเดินทางจาก"
    },
    {
      "code": "  ว.22",
      "detail": "ถึง......(สถานที่)"
    },
    {
      "code": "  ว.23",
      "detail": "ผ่าน"
    },
    {
      "code": "  ว.24",
      "detail": "เวลา/ขอทราบเวลา"
    },
    {
      "code": "  ว.25",
      "detail": "ไป"
    },
    {
      "code": "  ว.26",
      "detail": "ให้ติดต่อทาง ว.ให้น้อยที่สุด"
    },
    {
      "code": "  ว.27",
      "detail": "ให้ติดต่อทางโทรพิมพ์"
    },
    {
      "code": "  ว.28",
      "detail": "ประชุม/มีประชุม"
    },
    {
      "code": "  ว.29",
      "detail": "มีราชการ/ธุระ"
    },
    {
      "code": "  ว.30",
      "detail": "จำนวน/ขอทราบจำนวน"
    },
    {
      "code": "  ว.31",
      "detail": "เปลี่ยนไปใช้ความถี่ช่องที่ 1"
    },
    {
      "code": "  ว.32",
      "detail": "เปลี่ยนไปใช้ความถี่ช่องที่ 2"
    },
    {
      "code": "  ว.33",
      "detail": "เปลี่ยนไปใช้ความถี่ช่องที่ 3"
    },
    {
      "code": "  ว.34",
      "detail": "เปลี่ยนไปใช้ความถี่ช่องที่ 4"
    },
    {
      "code": "  ว.35",
      "detail": "เตรียมพร้อมปฏิบัติการ"
    },
    {
      "code": "  ว.36",
      "detail": "เตรียมความพร้อมเต็มอัตรา"
    },
    {
      "code": "  ว.37",
      "detail": "เตรียมความพร้อมครึ่งอัตรา"
    },
    {
      "code": "  ว.38",
      "detail": "เตรียมพร้อม 1/3 อัตรา"
    },
    {
      "code": "  ว.39",
      "detail": "สภาพการจราจรคับคั่ง"
    },
    {
      "code": "  ว.40",
      "detail": "อุบัติเหตุทางรถยนต์"
    },
    {
      "code": "  ว.41",
      "detail": "สัญญาณไฟจราจร"
    },
    {
      "code": "  ว.42",
      "detail": "ยานพาหนะนำขบวน/ยานพาหนะ"
    },
    {
      "code": "  ว.43",
      "detail": "จุดตรวจยานพาหนะ"
    },
    {
      "code": "  ว.44",
      "detail": "ติดต่อทางโทรสาร(FAG)"
    },
    {
      "code": "  ว.50",
      "detail": "รับประทานอาหาร"
    },
    {
      "code": "  ว.55",
      "detail": "ให้อำนวยความสะดวก"
    },
    {
      "code": "  ว.60",
      "detail": "ญาติ /พี่น้อง/เพื่อน"
    },
    {
      "code": "  ว.61",
      "detail": "ขอบคุณ"
    },
    {
      "code": "  ว.62",
      "detail": "สิ่งของ"
    },
    {
      "code": "  ว.63",
      "detail": "บ้าน"
    },
    {
      "code": "  ว.64",
      "detail": "มีธุระส่วนตัว"
    },
    {
      "code": " ว.72",
      "detail": "ฝนตก"
    },
    {
      "code": " ว.89",
      "detail": "เล่นการพนัน"
    },
    {
      "code": "  ว.100",
      "detail": "ขอโทษ/ขออภัย"
    },
    {
      "code": "  ว.601",
      "detail": "เครื่องรับ-ส่งวิทยุ"
    },
    {
      "code": "  ว.602",
      "detail": "สายอากาศวิทยุ"
    },
    {
      "code": "  ว.603",
      "detail": "รถยนต์"
    },
    {
      "code": "  ว.604",
      "detail": "ดูโทรทัศน์"
    },
    {
      "code": "  ว.605",
      "detail": "รับประทานอาหาร"
    },
    {
      "code": "  ว.606",
      "detail": "พูดจาไม่เป็นความจริง"
    },
    {
      "code": "  ว.607",
      "detail": "ธุรกิจส่วนตัว"
    },
    {
      "code": "  ว.608",
      "detail": "คนก่อกวน"
    },
    {
      "code": "  ว.609",
      "detail": "คลื่นรบกวน"
    },
    {
      "code": "  ว.610",
      "detail": "คิดถึง"
    },
    {
      "code": "  ว.621",
      "detail": "เงิน"
    }
  ]
  scene = [
    {
      "code": "  เหตุ 100",
      "detail": "มีเหตุประทุษร้ายต่อทรัพย์สิน"
    },
    {
      "code": "  เหตุ 111",
      "detail": "ลักทรัพย์"
    },
    {
      "code": "  เหตุ 121",
      "detail": "วิ่งราวทรัพย์"
    },
    {
      "code": "  เหตุ 131",
      "detail": "ชิงทรัพย์"
    },
    {
      "code": "  เหตุ 141",
      "detail": "ปล้นทรัพย์"
    },
    {
      "code": "  เหตุ 200",
      "detail": "มีเหตุประทุษร้ายต่อร่างกาย"
    },
    {
      "code": "  เหตุ 201",
      "detail": "เพลิงไหม้หญ้า"
    },
    {
      "code": "  เหตุ 202",
      "detail": "ไฟฟ้าลัดวงจร"
    },
    {
      "code": "  เหตุ 203",
      "detail": "เพลิงไหม้ยานพาหนะ"
    },
    {
      "code": "  เหตุ 204",
      "detail": "เพลิงไหม้(บ้าน ชุมชน อาคาร........)"
    },
    {
      "code": "  เหตุ 205",
      "detail": "เพลิงไหม้อาคารเก็บเชื้อเพลิงสารเคมี"
    },
    {
      "code": "  เหตุ 206",
      "detail": "เพลิงไหม้อาคารสูง อาคารขนาดใหญ่"
    },
    {
      "code": "  เหตุ 211",
      "detail": "ทำร้ายร่างกายไม่ได้รับบาดเจ็บ"
    },
    {
      "code": "  เหตุ 221",
      "detail": "ทำร้ายร่ายกาย ได้รับบาดเจ็บ"
    },
    {
      "code": "  เหตุ 231",
      "detail": "ทำร้ายร่ายกาย ได้รับบาดเจ็บสาหัส"
    },
    {
      "code": "  เหตุ 241",
      "detail": "ฆ่าคนตาย"
    },
    {
      "code": " เหตุ 295  ",
      "detail": "ทำร้ายร่างกาย "
    },
    {
      "code": " เหตุ 288  ",
      "detail": "ฆ่าคนอื่นโดยเจตนา "
    },
    {
      "code": "  เหตุ 300",
      "detail": "การพนัน"
    },
    {
      "code": " เหตุ 333 ",
      "detail": "อาวุธปืน มีอาวุธปืน"
    },
    {
      "code": " เหตุ 378 ",
      "detail": "เมาสุรา หรือ มีอาการเมาสุรา"
    },
    {
      "code": "  เหตุ 501",
      "detail": "วัตถุต้องสงวัยเกี่ยวกับระเบิด"
    },
    {
      "code": "  เหตุ 511",
      "detail": "ได้เกิดระเบืดขึ้นแล้ว"
    },
    {
      "code": "  เหตุ 512",
      "detail": "วัตถุระเบิดตรวจสอบแล้วไม่ระเบิด"
    },
    {
      "code": "  เหตุ 600",
      "detail": "นักเรียนจะก่อเหตุทะเลาะวิวาท"
    },
    {
      "code": "  เหตุ 601",
      "detail": "นักเรียนรวมกลุ่มมีสิ่งบอกเหตุเชื่อว่าจะก่อเหตุ"
    },
    {
      "code": "  เหตุ 602",
      "detail": "นักเรียนก่อเหตุหลบหนีไปแล้ว"
    },
    {
      "code": "  เหตุ 603",
      "detail": "นักเรียนยกพวกก่อเหตุทำร้ายกันและกัน"
    },
    {
      "code": "  เหตุ 604",
      "detail": "นักเรียนยกพวกก่อเหตุทำร้ายกันถึงความตาย"
    },
    {
      "code": "  เหตุ 605",
      "detail": "นักเรียนยกพวกก่อเหตุทำร้ายกันมีวัตถุระเบิด"
    },
    {
      "code": "  เหตุ 606",
      "detail": "ข้อความไม่ถูกต้อง"
    },
    {
      "code": "  เหตุ 607",
      "detail": "กิจธุระส่วนตัว"
    },
    {
      "code": "  เหตุ 608",
      "detail": "มีสัญญาณรบกวน แปลกปลอม"
    },
    {
      "code": "  เหตุ 609",
      "detail": "คลื่นรบกวน"
    }
   
  ]
  PhoneticAlphabets = [
    {
      "code": "A ALFA ",
      "detail": "แอล-ฟา "
    },
    {
      "code": "B BRAVO ",
      "detail": "บรา-โว "
    },
    {
      "code": "C CHARLIE ",
      "detail": "ชา-ลี "
    },
    {
      "code": "D DELTA ",
      "detail": "เดล-ต้า "
    },
    {
      "code": "E ECHO",
      "detail": "เอค-โค่ "
    },
    {
      "code": "F FOXTROT ",
      "detail": "ฟ็อก-ทรอท "
    },
    {
      "code": "G GOLF ",
      "detail": "ก็อลฟ์ "
    },
    {
      "code": "H HOTEL ",
      "detail": "โฮ-เทล "
    },
    {
      "code": "I INDIA ",
      "detail": " อิน-เดีย "
    },
    {
      "code": "J JULIETT ",
      "detail": "จู-เลียด "
    },
    {
      "code": "K KILO ",
      "detail": "กิ-โล "
    },
    {
      "code": "L LIMA  ",
      "detail": "ลิ-ม่า "
    },
    {
      "code": "M MIKE ",
      "detail": "ไม้ค "
    },
    {
      "code": "N NOVEMBER ",
      "detail": "โนะ-เวม-เบอะ "
    },
    {
      "code": "O OSCAR",
      "detail": "ออช-คาร์ "
    },
    {
      "code": "P PAPA ",
      "detail": "ปา-ปา "
    },
    {
      "code": "Q QUEBEC  ",
      "detail": "คี-เบค "
    },
    {
      "code": "R ROMEO ",
      "detail": "โร-มิ-โอ "
    },
    {
      "code": "S SIERRA ",
      "detail": "เซีย-ร่า "
    },
    {
      "code": "T TANGO ",
      "detail": "แทง-โก "
    },
    {
      "code": "U UNIFORM ",
      "detail": "ยู-นิ-ฟอม "
    },
    {
      "code": "V VICTOR ",
      "detail": "วิก-เทอะ (วิก-ต้าร์) "
    },
    {
      "code": "W WHISKEY ",
      "detail": "วีช-กี้ "
    },
    {
      "code": "X X-RAY ",
      "detail": "เอ็กซ์-เร "
    },
    {
      "code": "Y YANKEE ",
      "detail": "แยง-กี้ "
    },
    {
      "code": "Z ZULU ",
      "detail": "ซู-ลู"
    }
  ]



}